MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_debug.c
			if(txt_idx >= MAX_MDNS_TXT_NUM) {
				RTW_INFO(FUNC_ADPT_FMT ": input txt idx, %d, is out of range (0~%d)!\n", FUNC_ADPT_ARG(padapter), txt_idx, MAX_MDNS_TXT_NUM-1);
				count = -EFAULT;    
				goto exit;
			}

			if(pwrpriv->wowlan_war_offload_mdns_txt_rsp[txt_idx].txt_len == 0) {
				RTW_INFO(FUNC_ADPT_FMT ": wowlan_war_offload_mdns_txt_rsp[%d] is null! Please initiate it first.\n", FUNC_ADPT_ARG(padapter), txt_idx);
				count = -EFAULT;    
				goto exit;
			}
			
			// 1. set the value of members for this new service
			psinfo[idx].service_len = strlen(srv);
			_rtw_memcpy(psinfo[idx].service, srv, psinfo[idx].service_len );
			psinfo[idx].transport_len = strlen(trans);
			_rtw_memcpy(psinfo[idx].transport, trans, psinfo[idx].transport_len );
			psinfo[idx].domain_len = strlen(domain);
			_rtw_memcpy(psinfo[idx].domain, domain, psinfo[idx].domain_len );
			psinfo[idx].target_len = strlen(target);
			_rtw_memcpy(psinfo[idx].target, target, psinfo[idx].target_len );
			_rtw_memcpy(psinfo[idx].port, port, 2 );
			psinfo[idx].ttl = ttl;
			psinfo[idx].txt_rsp_idx = txt_idx;
			pwrpriv->wowlan_war_offload_mdns_service_info_num++;
		}
	}

exit:	
	if(tmp)
		rtw_vmfree(tmp, sizeof(char)*(max_input_size));
	return count;

}

int proc_get_war_offload_mdns_txt_rsp(struct seq_file *m, void *v)
{
	struct net_device *dev = m->private;
	_adapter *adapter = (_adapter *)rtw_netdev_priv(dev);
	struct dvobj_priv *dvobj = adapter_to_dvobj(adapter);
	struct pwrctrl_priv *pwrpriv = dvobj_to_pwrctl(dvobj);
	int i=0;

	if (_TRUE == pwrpriv->wowlan_war_offload_mode) {
		if ((WAR_MDNS_V4_RSP_EN & pwrpriv->wowlan_war_offload_ctrl) ||
			(WAR_MDNS_V6_RSP_EN & pwrpriv->wowlan_war_offload_ctrl) ) {
			for(i=0; i<pwrpriv->wowlan_war_offload_mdns_txt_rsp_num; i++) {
				RTW_PRINT_SEL(m, "[%d]", i);
				if(pwrpriv->wowlan_war_offload_mdns_txt_rsp[i].txt_len==0){
					RTW_PRINT_SEL(m, " (null)\n");
					continue;
				}
				rtw_wow_war_mdns_dump_txt(m, "type txt rsp. (Str)", 
					pwrpriv->wowlan_war_offload_mdns_txt_rsp[i].txt, pwrpriv->wowlan_war_offload_mdns_txt_rsp[i].txt_len);
				rtw_wow_war_mdns_dump_buf(m, "type txt rsp. (Hex)", 
					pwrpriv->wowlan_war_offload_mdns_txt_rsp[i].txt, pwrpriv->wowlan_war_offload_mdns_txt_rsp[i].txt_len);
			}
			RTW_PRINT_SEL(m, "\n");
		} else {
			RTW_PRINT_SEL(m, "\nMSND RSP Not enabled\n\n");
		}
	} else {
		RTW_PRINT_SEL(m, "\nOffload Not enabled\n\n");
	}

	return 0;
}

ssize_t proc_set_war_offload_mdns_txt_rsp(struct file *file, const char __user *buffer, size_t count, loff_t *pos, void *data)
{
	struct net_device *dev = data;
	_adapter *padapter = (_adapter *)rtw_netdev_priv(dev);
	struct dvobj_priv *dvobj = adapter_to_dvobj(padapter);
	struct pwrctrl_priv *pwrpriv = dvobj_to_pwrctl(dvobj);
	u16 max_input_size = (1+6+MAX_MDNS_TXT_SINGLE_LEN+2);
	char* tmp=NULL;
	char op[7]={0}, txt_str[MAX_MDNS_TXT_SINGLE_LEN+1]={0};
	int idx;

	if (NULL == buffer) {
		RTW_INFO(FUNC_ADPT_FMT ": input buffer is NULL!\n", FUNC_ADPT_ARG(padapter));
		return -EFAULT;
	}

	if (count < 1) {
		RTW_INFO(FUNC_ADPT_FMT ": input length is 0!\n", FUNC_ADPT_ARG(padapter));
		return -EFAULT;
	}

	tmp = rtw_zvmalloc(sizeof(char)*(max_input_size));
	if (NULL == tmp) {
		RTW_INFO(FUNC_ADPT_FMT ": tmp buffer allocate fail!!\n", FUNC_ADPT_ARG(padapter));
		count = -EFAULT;	
		goto exit;
	}

	if (buffer && !copy_from_user(tmp, buffer, count)) {

		if( strncmp(tmp, "clean", 5) == 0 )
		{
			/* clean ==> */
			if(pwrpriv->wowlan_war_offload_mdns_service_info_num==0){
				_rtw_memset(pwrpriv->wowlan_war_offload_mdns_txt_rsp, 0, sizeof(pwrpriv->wowlan_war_offload_mdns_txt_rsp));
			}else{
				RTW_INFO(FUNC_ADPT_FMT ": Txt rsp are refered! (Current service_info_num = %d)\n", FUNC_ADPT_ARG(padapter), pwrpriv->wowlan_war_offload_mdns_service_info_num);
				count = -EFAULT;
				goto exit;     
			 }

		}else{
			/* set ==> */
			int num = sscanf(tmp, "%d %6s %256c", &idx, op, txt_str);
			u16 sscanf_parameter_length = 0, txt_len = 0;

			txt_len = (strlen(txt_str)>MAX_MDNS_TXT_SINGLE_LEN)?MAX_MDNS_TXT_SINGLE_LEN:(strlen(txt_str)-1);
			txt_str[txt_len]='\0';
			sscanf_parameter_length = 1 + strlen(op) + txt_len + num;

			if(count != sscanf_parameter_length) {
				RTW_INFO(FUNC_ADPT_FMT ": Length of total parameters does not match the input buffer. (%d != %lu)(num=%d)\n", 
					FUNC_ADPT_ARG(padapter), sscanf_parameter_length, count, num);
				RTW_INFO(FUNC_ADPT_FMT ": Please check the content and length of each parameter.\n", FUNC_ADPT_ARG(padapter));
				RTW_INFO(FUNC_ADPT_FMT ": input buffer = (%s)(%lu)!\n\n", FUNC_ADPT_ARG(padapter), tmp, count);
				RTW_INFO(FUNC_ADPT_FMT ": op. = %s (%lu)!\n", FUNC_ADPT_ARG(padapter), op, strlen(op));
				RTW_INFO(FUNC_ADPT_FMT ": txt = %s (%lu)!\n", FUNC_ADPT_ARG(padapter), txt_str, strlen(txt_str));
				count = -EFAULT;
				goto exit;
			} else {

				u16 offset;

				if(idx >= MAX_MDNS_TXT_NUM) {
					RTW_INFO(FUNC_ADPT_FMT ": the index, %d, is over the range of txt rsp(0~%d)!\n", FUNC_ADPT_ARG(padapter), idx, MAX_MDNS_TXT_NUM-1);
					count = -EFAULT;
					goto exit; 
				}

				if( strncmp(op, "new", 3) == 0 ) {
					_rtw_memset(pwrpriv->wowlan_war_offload_mdns_txt_rsp[idx].txt, 0, pwrpriv->wowlan_war_offload_mdns_txt_rsp[idx].txt_len);
					pwrpriv->wowlan_war_offload_mdns_txt_rsp[idx].txt_len = 0;
				}else if(strncmp(op, "append", 6) == 0 ){
					if((pwrpriv->wowlan_war_offload_mdns_txt_rsp[idx].txt_len+strlen(txt_str)+1) > MAX_MDNS_TXT_LEN) {
						RTW_INFO(FUNC_ADPT_FMT ": the txt rsp(%d) will be over the limitation(%d) if append input string(%lu)!\n", FUNC_ADPT_ARG(padapter), 
						pwrpriv->wowlan_war_offload_mdns_txt_rsp[idx].txt_len,
						MAX_MDNS_TXT_LEN, strlen(txt_str)+1);
						count = -EFAULT;
						goto exit; 
					}
				}else{
					RTW_INFO(FUNC_ADPT_FMT ": Invaild op str %s (new/append only)!\n", FUNC_ADPT_ARG(padapter), op);
					count = -EFAULT;
					goto exit;
				}

				offset = pwrpriv->wowlan_war_offload_mdns_txt_rsp[idx].txt_len;
				pwrpriv->wowlan_war_offload_mdns_txt_rsp[idx].txt[offset++] = strlen(txt_str);
				_rtw_memcpy(pwrpriv->wowlan_war_offload_mdns_txt_rsp[idx].txt + offset, txt_str, strlen(txt_str));
				pwrpriv->wowlan_war_offload_mdns_txt_rsp[idx].txt_len += (strlen(txt_str) + 1);  /* actul len with length field */

				/* Dump ==> */
				//RTW_PRINT_SEL(RTW_DBGDUMP, "[%d]", idx);
				//rtw_wow_war_mdns_dump_txt(RTW_DBGDUMP, "type txt rsp. (Str)", 
				//		pwrpriv->wowlan_war_offload_mdns_txt_rsp[idx].txt, pwrpriv->wowlan_war_offload_mdns_txt_rsp[idx].txt_len);         
			}
		}
	}

