MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_debug.c
	return count;
}

int proc_get_ap_csa_cnt(struct seq_file *m, void *v)
{
	struct net_device *dev = m->private;
	_adapter *adapter = (_adapter *)rtw_netdev_priv(dev);
	struct rf_ctl_t *rfctl;
	rfctl = adapter_to_rfctl(adapter);

	RTW_PRINT_SEL(m, "ap_csa_switch_cnt = %u\n", rfctl->ap_csa_cnt_input);

	return 0;
}
#endif
#ifdef PRIVATE_R
ssize_t proc_set_p2p_park_ch(struct file *file, const char __user *buffer, size_t count, loff_t *pos, void *data)
{
	struct net_device *dev = data;
	_adapter *a = (_adapter *)rtw_netdev_priv(dev);
	struct rf_ctl_t *rfctl = adapter_to_rfctl(a);
	char tmp[32];
	u8 p2p_park_ch = 36;

	if (count < 1) {
		RTW_INFO("argument size is less than 1\n");
		return -EFAULT;
	}

	if (count > sizeof(tmp)) {
		rtw_warn_on(1);
		return -EFAULT;
	}

	if (buffer && !copy_from_user(tmp, buffer, count)) {
		int num = sscanf(tmp, "%hhu", &p2p_park_ch);
		if (num !=  1)
			return count;
	}

	if (p2p_park_ch != 36 && p2p_park_ch != 149)
		RTW_ERR("Only CH 36 or CH 149 is allowed\n");
	else
		rfctl->p2p_park_ch = p2p_park_ch;

	return count;
}

int proc_get_p2p_park_ch(struct seq_file *m, void *v)
{
	struct net_device *dev = m->private;
	_adapter *a = (_adapter *)rtw_netdev_priv(dev);
	struct rf_ctl_t *rfctl = adapter_to_rfctl(a);

	RTW_PRINT_SEL(m, "p2p_park_ch: %u\n", rfctl->p2p_park_ch);

	return 0;
}
#endif /* PRIVATE_R */
#endif /* CONFIG_ECSA */

int proc_get_disconnect_info(struct seq_file *m, void *v)
{
	struct net_device *dev = m->private;
	_adapter *padapter = (_adapter *)rtw_netdev_priv(dev);
	struct mlme_ext_priv *pmlmeext = &padapter->mlmeextpriv;
	struct mlme_ext_info *pmlmeinfo = &(pmlmeext->mlmext_info);
	char *disconnect_reason = "";
	char *illegal_beacon_reason = "";

	if (pmlmeinfo) {
		switch (pmlmeinfo->disconnect_code) {
		case DISCONNECTION_NOT_YET_OCCUR:
			disconnect_reason = "Disconnection has not yet occurred.";
			break;
		case DISCONNECTION_BY_SYSTEM_DUE_TO_HIGH_LAYER_COMMAND:
			disconnect_reason = "System requests to disconnect by command.";
			break;
		case DISCONNECTION_BY_SYSTEM_DUE_TO_NET_DEVICE_DOWN:
			disconnect_reason = "System makes net_device down to cause disconnection.";
			break;
		case DISCONNECTION_BY_SYSTEM_DUE_TO_SYSTEM_IN_SUSPEND:
			disconnect_reason = "System enters suspend state to cause disconnection.";
			break;
		case DISCONNECTION_BY_DRIVER_DUE_TO_CONNECTION_EXIST:
			disconnect_reason = "The connection is exist so it triggers disconnection when joinbss.";
			break;
		case DISCONNECTION_BY_DRIVER_DUE_TO_EACH_IFACE_CHBW_NOT_SYNC:
			disconnect_reason = "Multiple interfaces do not synchronize channel and bandwidth when joinbss.";
			break;
		case DISCONNECTION_BY_DRIVER_DUE_TO_DFS_DETECTION:
			disconnect_reason = "DFS Slave mechanism detects radar to cause disconnection.";
			break;
		case DISCONNECTION_BY_DRIVER_DUE_TO_IOCTL_DBG_PORT:
			disconnect_reason = "Using ioctl dbg port command to accomplish disconnection.";
			break;
		case DISCONNECTION_BY_DRIVER_DUE_TO_AP_BEACON_CHANGED:
			disconnect_reason = "AP's beacon content was changed to cause disconnection.";
			break;
		case DISCONNECTION_BY_DRIVER_DUE_TO_KEEPALIVE_TIMEOUT:
			disconnect_reason = "Maybe AP disappears to trigger station keepalive timeout and connection break.";
			break;
		case DISCONNECTION_BY_DRIVER_DUE_TO_LAYER2_ROAMING_TERMINATE:
			disconnect_reason = "Layer2 roaming terminated to trigger disconnection.";
			break;
		case DISCONNECTION_BY_DRIVER_DUE_TO_JOINBSS_TIMEOUT:
			disconnect_reason = "Station joinbss process is timeout to trigger disconnection.";
			break;
		case DISCONNECTION_BY_FW_DUE_TO_FW_DECISION_IN_WOW_RESUME:
			disconnect_reason = "FW decides to disconnect in WOW resume flow.";
			break;
		case DISCONNECTION_BY_AP_DUE_TO_RECEIVE_DISASSOC_IN_WOW_RESUME:
			disconnect_reason = "Receiving Disassociation frame from AP to cause disconnection in WOW resume flow.";
			break;
		case DISCONNECTION_BY_AP_DUE_TO_RECEIVE_DEAUTH_IN_WOW_RESUME:
			disconnect_reason = "Receiving Deauth frame from AP to cause disconnection in WOW resume flow.";
			break;
		case DISCONNECTION_BY_AP_DUE_TO_RECEIVE_DEAUTH:
			disconnect_reason = "Receiving Deauth frame from AP to cause disconnection.";
			break;
		case DISCONNECTION_BY_AP_DUE_TO_RECEIVE_DISASSOC:
			disconnect_reason = "Receiving Disassociation frame from AP to cause disconnection.";
			break;
		case DISCONNECTION_BY_DRIVER_DUE_TO_RECEIVE_CSA_NON_DFS:
			disconnect_reason = "Disconnection due to AP switched to unsupported channel.";
			break;
		case DISCONNECTION_BY_DRIVER_DUE_TO_RECEIVE_CSA_DFS:
			disconnect_reason = "Disconnection due to AP switched to unsupported DFS channel.";
			break;
		default:
			disconnect_reason = "Unspecified";
			break;
		}

		RTW_PRINT_SEL(m, "occurred disconnection time = %d\n", pmlmeinfo->disconnect_occurred_time);
		RTW_PRINT_SEL(m, "disconnect code = %d\n", pmlmeinfo->disconnect_code);
		RTW_PRINT_SEL(m, "last disconnect reason: %s\n", disconnect_reason);
		RTW_PRINT_SEL(m, "beacon code: %d\n", pmlmeinfo->illegal_beacon_code);
		if (pmlmeinfo->disconnect_code == DISCONNECTION_BY_DRIVER_DUE_TO_AP_BEACON_CHANGED) {
			if (pmlmeinfo->illegal_beacon_code & SSID_CHANGED)
				RTW_PRINT_SEL(m, "illegal beacon reason: The SSID of beacon is changed.\n");
			if (pmlmeinfo->illegal_beacon_code & SSID_LENGTH_CHANGED)
				RTW_PRINT_SEL(m, "illegal beacon reason: The SSID length of beacon is changed.\n");
			if (pmlmeinfo->illegal_beacon_code & BEACON_CHANNEL_CHANGED)
				RTW_PRINT_SEL(m, "illegal beacon reason: The Beacon channel of beacon is changed.\n");
			if (pmlmeinfo->illegal_beacon_code & ENCRYPT_PROTOCOL_CHANGED)
				RTW_PRINT_SEL(m, "illegal beacon reason: The Encrypt protocol of beacon is changed.\n");
			if (pmlmeinfo->illegal_beacon_code & PAIRWISE_CIPHER_CHANGED)
				RTW_PRINT_SEL(m, "illegal beacon reason: The Pairwise cipheris of beacon changed.\n");
			if (pmlmeinfo->illegal_beacon_code & GROUP_CIPHER_CHANGED)
				RTW_PRINT_SEL(m, "illegal beacon reason: The Group cipher of beacon is changed.\n");
			if (pmlmeinfo->illegal_beacon_code & IS_8021X_CHANGED)
				RTW_PRINT_SEL(m, "illegal beacon reason: The 802.1x of beacon is changed.\n");
		} else {
			RTW_PRINT_SEL(m, "illegal beacon reason: NA.\n");
		}

		RTW_PRINT_SEL(m, "Wi-Fi reason code: %d\n",
			(pmlmeinfo->disconnect_code) ? pmlmeinfo->wifi_reason_code : 0);
	}
	return 0;
}

ssize_t proc_set_disconnect_info(struct file *file, const char __user *buffer,
				 size_t count, loff_t *pos, void *data)
{
	struct net_device *dev = data;
	_adapter *padapter = (_adapter *)rtw_netdev_priv(dev);
	struct mlme_ext_priv *pmlmeext = &padapter->mlmeextpriv;
	struct mlme_ext_info *pmlmeinfo = &(pmlmeext->mlmext_info);
	char tmp[32];
	u8 clear;

	if (!pmlmeinfo)
		return -EPERM;

	if (count < 1)
		return -EFAULT;

	if (count > sizeof(tmp)) {
		rtw_warn_on(1);
		return -EFAULT;
	}

	if (buffer && !copy_from_user(tmp, buffer, count)) {
		int num = sscanf(tmp, "%hhd", &clear);
		if (num == 1 && clear == 0) {
			pmlmeinfo->disconnect_occurred_time = 0;
			pmlmeinfo->disconnect_code = DISCONNECTION_NOT_YET_OCCUR;
			pmlmeinfo->illegal_beacon_code = 0;
		}
	}

